[
    {
        "position": "Team Leader, at Tesco Stores s.r.o",
        "year": "2012 - 2023",
        "location": "District Brno-City, Czech Republic",
        "description": [
            "<b>Team Leadership: </b>Managed a team of 12 employees, providing regular training and coaching focused on developing professional competencies, monitoring performance, and implementing strategies to improve efficiency and effectiveness.",
            "<b>Shift Planning: </b>Effectively planned shifts and managed work schedules to ensure smooth operations and adequate staffing based on current needs.",
            "<b>Customer Service: </b>Handled customer complaints and claims, provided support, and actively ensured customer satisfaction.",
            "<b>Administration: </b>Managed administrative tasks related to invoicing and daily sales – including invoice processing, end-of-day reconciliation, and cash register documentation. Responsible for recruiting temporary staff, coordinating with staffing agencies, and ensuring sufficient personnel coverage based on operational needs.",
            "<b>Internal Automation: </b>Proactively proposed improvements to internal processes and developed simple applications and tools to standardize workflows and enhance efficiency."
        ]
    },
    {
        "position": "Computer support and Team leader at \"Stadium\" - entertainment center",
        "year": "2008 - 2011",
        "location": "66 Karaoli & Dimitriou str., 562 24 Thessaloniki - Evosmos, Greece",
        "description": [
            "<b>Team Leadership: </b>Managed a team of 9 employees.",
            "<b>Shift Planning: </b>Effectively planned shifts and managed work schedules to ensure smooth operations and adequate staffing based on current needs.",
            "<b>Order Management: </b>Handled processing, tracking, and fulfillment of orders with a focus on accuracy, timeliness, and customer satisfaction.",
            "<b>Customer Service: </b>Delivered exceptional customer service, addressing and resolving customer inquiries and issues promptly to ensure satisfaction.",
            "<b>Technical Support: </b>Performed computer repairs and troubleshooting, resolving technical issues and ensuring the smooth operation of IT systems.",
            "<b>Process Improvement: </b>Identified and implemented process improvements to enhance team efficiency and service quality."
        ]
    },
    {
        "position": "Driver and Property Control Officer at Greek Army",
        "year": "2007 - 2008",
        "location": "Kaválla, Eastern Macedonia and Thrace, Greece",
        "description": [
            "<b>Driving activity: </b>Responsible for the safe and timely transportation of goods.",
            "<b>Security control and property protection: </b>Checked soldiers leaving the barracks to prevent unauthorized removal of military property."
        ]
    },
    {
        "position": "Customer Service and IT Technical Support at \"College\" - internet cafe",
        "year": "2006 - 2007",
        "location": "48 Gevgelis str., 561 21 Thessaloniki - Ampelokipoi, Greece",
        "description": [
            "<b>Customer Service: </b>Handled customer inquiries, complaints, and issues while ensuring effective and satisfactory resolutions.",
            "<b>System Monitoring: </b>Monitored computer usage, detected unusual activity, and ensured smooth operation of all systems.",
            "<b>User Management: </b>Created and managed user accounts.",
            "<b>Financial Transactions: </b>Handling payments, managing cash flow, and maintaining accurate records of transactions.",
            "<b>Technical Support: </b>Performed computer repairs, diagnosed and resolved technical issues, installed applications, and ensured smooth operation of IT systems."
        ]
    },
    {
        "position": "School practice at Altec s.a.",
        "year": "2006",
        "location": "Michail Kalou 6, 546 29 Thessaloniki, Greece",
        "description": [
            "<b>Technical Support: </b>Installed and configured computer units, connected devices to the network, and resolved issues with peripheral equipment."
        ]
    }

]